**** Extracting Claims

For example, to get the "sub" claim:
#+begin_src emacs-lisp
(let* ((token-string     "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQ.SflKxwRJSMeKKF2QT4fwpMeJf36POk6yJV_adQssw5c")
      (decoded-token (jwt-to-token-json token-string)))
  (map-elt (jwt-token-json-payload-parsed decoded-token) "sub"))
#+end_src

#+RESULTS:
: 1234567890

Note that the output of ~jwt-token-json~ has JSON strings in its slots. You need to use either
~jwt-token-json-payload-parsed~ or ~jwt-token-json-header-parsed~ to get the JSON as a Lisp object.

The ~map~ library is very helpful for dealing with parsed JSON.

**** Verify HMAC Signatures

To verify HMAC signatures you need the private key used to sign the token.

Note that the key is read as a list of bytes. So if your key is base64 encoded, you should first decode it:
#+begin_src emacs-lisp
(let* ((key-string "IUILGn96IQgxBoPgvH0IJ7J9+KhqCGzvwgBZI88qwsw=")
       (byte-string (base64-decode-string key-string)))
  (print (string-to-list byte-string)))
#+end_src

#+RESULTS:
| 33 | 66 | 11 | 26 | 127 | 122 | 33 | 8 | 49 | 6 | 131 | 224 | 188 | 125 | 8 | 39 | 178 | 125 | 248 | 168 | 106 | 8 | 108 | 239 | 194 | 0 | 89 | 35 | 207 | 42 | 194 | 204 |

#+begin_src emacs-lisp
(let* ((key-string "IUILGn96IQgxBoPgvH0IJ7J9+KhqCGzvwgBZI88qwsw=")
       (key (base64-decode-string key-string) "a.b.c")
       (token "eyJhbGciOiJoczI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQ.Adw8gL7v0IwVQsq3B8n6v_0AxdUBJoLmPTiFaP9LYCA"))
  (jwt-verify-signature token key))
#+end_src

#+RESULTS:
: t

**** Create HMAC Signatures

Here we sign with just a randomly generated key:
#+begin_src emacs-lisp
(let* ((key (jwt--random-bytes 64))
       (payload '((sub . "1234567890")
                  (name . "John Doe")
                  (iat . 1516239022))))
  (jwt-create payload "hs256" key))
#+end_src

#+RESULTS:
: eyJhbGciOiJoczI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQ.ZAOIiHXlIQxtozfGNeSdhw1S_zSLwGKL0o_apPLPJ1I

You can set the "iat" claim to reflect current time, like so:
#+begin_src emacs-lisp
(let* ((key (jwt--random-bytes 64))
       (payload '((sub . "1234567890")
                  (name . "John Doe")))
       (token (jwt-create payload "hs256" key nil 't)))
  (map-elt (jwt-token-json-payload-parsed (jwt-to-token-json token)) "iat"))
#+end_src

#+RESULTS:
: 1726509832

